{
    "node_1": {
        "description": "**Current State:**  \n- at_shore: true  \n- at_jungle_edge: false  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has just arrived alone on the island shore, carrying a backpack, an old map, and a compass. He has not yet ventured inland or encountered any natives or dangers.\n\n**Narrative Description:**  \nThe salty breeze brushes against your face as you stand on the sun-drenched shore of the mysterious island. Palm trees sway gently behind you, and the dense jungle looms ahead like a dark, impenetrable wall. Your grandfather’s old map, worn and faded, flutters in your hand, revealing only a partial path inland. The compass needle quivers uncertainly, as if the island itself resists your intrusion. The distant calls of exotic birds echo through the humid air, mingling with the faint rustle of unseen creatures. You know the sacred medallion lies hidden somewhere beyond the jungle edge, but the path is fraught with danger—venomous traps, hostile natives, and confusing trails. Your heart pounds with a mix of excitement and caution. The first step is clear: you must leave the safety of the shore and find your way to the jungle’s edge. Every choice now will shape your fate on this enigmatic island.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Venture directly into the dense jungle, following the map’s faint trail*: (at_shore: false, at_jungle_edge: true)",
                "target": "node_2"
            },
            "option_1": {
                "text": "*Scout along the shoreline to find a safer path inland, avoiding dense undergrowth*: (at_shore: false, at_jungle_edge: true, wounded: false)",
                "target": "node_3"
            },
            "option_2": {
                "text": "*Attempt to rest and prepare more supplies before moving inland*: (at_shore: true, wounded: false)",
                "target": "node_1"
            },
            "option_3": {
                "text": "*Call out to see if any natives are nearby for guidance*: (at_shore: true, ally_present: false)",
                "target": "node_4"
            }
        }
    },
    "node_2": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has chosen a direct, risky path into the jungle and reached its edge without injury or allies.\n\n**Narrative Description:**  \nPushing through thick vines and tangled roots, you emerge at the jungle’s edge. The canopy above filters sunlight into mottled patterns on the forest floor. The air is thick with humidity and the scent of damp earth. You hear the distant roar of a waterfall and the chatter of unseen animals. The map’s faded lines hint at a collapsed cave nearby, rumored to hold the sacred medallion. Yet, the jungle is treacherous—venomous traps lie hidden beneath leaves, and the path forks confusingly. You feel the weight of solitude pressing down, but your resolve is firm. Ahead, the cave beckons, promising both danger and the key to earning the natives’ trust. Every step must be measured; one misstep could mean injury or worse.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Proceed cautiously toward the collapsed cave, watching for traps*: (at_collapsed_cave: true)",
                "target": "node_5"
            },
            "option_1": {
                "text": "*Explore the jungle outskirts to search for signs of natives or safer paths*: (ally_present: true)",
                "target": "node_6"
            },
            "option_2": {
                "text": "*Attempt to set simple traps to protect yourself from predators*: (wounded: false)",
                "target": "node_7"
            }
        }
    },
    "node_3": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has taken a safer, longer route along the shore and reached the jungle edge without injury.\n\n**Narrative Description:**  \nYou skirt the shoreline, seeking a gentler path inland. The sand gives way to tangled roots and low bushes, but the undergrowth is less dense here. The sun beats down relentlessly, and the distant rumble of thunder hints at an approaching storm. You find signs of recent native activity—footprints and faint smoke rising beyond the trees. The jungle edge feels less forbidding, but time is slipping away. The medallion’s location remains a mystery, and the map offers no further clues. You must decide whether to press on toward the cave or seek out the natives for guidance. The choice could mean the difference between peril and alliance.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Head directly into the jungle toward the collapsed cave*: (at_collapsed_cave: true)",
                "target": "node_5"
            },
            "option_1": {
                "text": "*Follow the smoke to the native village, hoping to earn trust early*: (at_village: true)",
                "target": "node_8"
            },
            "option_2": {
                "text": "*Set up a temporary camp to wait out the storm and gather strength*: (wounded: false)",
                "target": "node_9"
            }
        }
    },
    "node_4": {
        "description": "**Current State:**  \n- at_shore: true  \n- at_jungle_edge: false  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer remains at the shore and attempts to contact natives.\n\n**Narrative Description:**  \nYou call out into the dense jungle, your voice echoing against the towering trees. Moments later, a figure emerges—a native explorer, wary but curious. His eyes study you carefully, gauging your intentions. The air is thick with tension, but also possibility. This encounter could be a turning point: an ally gained or an enemy made. The native’s presence promises knowledge of the island’s secrets, but trust must be earned. You feel the weight of your grandfather’s legacy pressing on you, and the medallion’s importance becomes clearer. Will you risk this uncertain alliance or continue alone?\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Offer a gift from your backpack to earn the native’s trust*: (ally_present: true)",
                "target": "node_6"
            },
            "option_1": {
                "text": "*Insist on proceeding alone, refusing help*: (ally_present: false)",
                "target": "node_2"
            },
            "option_2": {
                "text": "*Ask the native for guidance to the jungle edge*: (ally_present: true, at_jungle_edge: true)",
                "target": "node_2"
            }
        }
    },
    "node_5": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- at_collapsed_cave: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has reached the collapsed cave but has not yet found the medallion.\n\n**Narrative Description:**  \nThe collapsed cave yawns before you, a jagged maw of broken stone and shadow. The air is cool and damp, carrying the faint scent of ancient earth and forgotten secrets. Your footsteps echo softly as you navigate the unstable rubble, every movement fraught with risk. Venomous traps, cleverly concealed, threaten to end your quest prematurely. The medallion, carved from obsidian and sacred to the natives, is said to lie within these ruins. Your heart pounds as you search, fingers brushing against cold stone and brittle bones. The silence is broken only by distant dripping water and the occasional scurry of unseen creatures. Success here means earning the natives’ trust; failure could mean injury or worse.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Search carefully for the medallion, avoiding traps*: (medallion_found: true)",
                "target": "node_10"
            },
            "option_1": {
                "text": "*Rush through the cave to find the medallion quickly*: (wounded: true)",
                "target": "node_11"
            },
            "option_2": {
                "text": "*Retreat to the jungle edge to reconsider your approach*: (at_collapsed_cave: false, at_jungle_edge: true)",
                "target": "node_2"
            }
        }
    },
    "node_6": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: true  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has gained an ally, a native explorer, and is at the jungle edge.\n\n**Narrative Description:**  \nWith the native explorer by your side, the jungle seems less daunting. His knowledge of hidden paths and safe clearings guides you through the dense foliage. The sounds of the jungle—chirping insects, distant howls, and rustling leaves—become a symphony of survival rather than a threat. Your companion points out venomous plants and warns of traps, his calm presence a balm to your nerves. Together, you approach the collapsed cave, the medallion’s resting place. The alliance feels fragile but promising; trust is a currency more valuable than gold here. The path ahead is still perilous, but with guidance, your chances improve.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Enter the collapsed cave with your ally to search for the medallion*: (at_collapsed_cave: true)",
                "target": "node_12"
            },
            "option_1": {
                "text": "*Visit the native village first to strengthen your alliance*: (at_village: true, native_trust_earned: true)",
                "target": "node_13"
            },
            "option_2": {
                "text": "*Scout the jungle outskirts for additional clues or supplies*: (wounded: false)",
                "target": "node_7"
            }
        }
    },
    "node_7": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer is at the jungle edge, attempting to set traps or gather resources.\n\n**Narrative Description:**  \nYou pause to set simple traps around your camp, hoping to deter predators and gain a moment’s safety. The jungle’s cacophony surrounds you—buzzing insects, distant birdcalls, and the rustle of leaves. Your hands work quickly, weaving vines and sharpening sticks. The effort is taxing but necessary. As you finish, dark clouds gather overhead, and the first drops of a tropical storm begin to fall. The jungle’s mood shifts; the air thickens with tension. Your traps may buy you time, but the storm threatens to wash away your progress. You must decide whether to press on or seek shelter.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Press forward toward the collapsed cave despite the storm*: (wounded: true, at_collapsed_cave: true)",
                "target": "node_11"
            },
            "option_1": {
                "text": "*Find shelter and wait out the storm to recover*: (wounded: false)",
                "target": "node_9"
            }
        }
    },
    "node_8": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- at_village: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has reached the native village without the medallion.\n\n**Narrative Description:**  \nYou step cautiously into the native village, a cluster of thatched huts nestled among towering trees. Curious eyes watch from shaded doorways, and children peek from behind woven screens. The air is thick with the scent of cooking fires and tropical flowers. Yet, a palpable tension lingers; the natives are wary of outsiders, especially those who come empty-handed. Without the sacred medallion, your presence is met with suspicion. Whispers ripple through the crowd, and a few warriors grip their spears tightly. You realize that trust cannot be earned here without the medallion. Your quest feels stalled, and the path forward uncertain.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Attempt to negotiate and explain your mission despite lacking the medallion*: (native_trust_earned: false, wounded: true)",
                "target": "node_14 ❌"
            },
            "option_1": {
                "text": "*Leave the village immediately to find the medallion first*: (at_village: false, at_collapsed_cave: true)",
                "target": "node_5"
            }
        }
    },
    "node_9": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has chosen to rest and wait out the storm at the jungle edge.\n\n**Narrative Description:**  \nYou find a sheltered nook beneath a giant fig tree and set up a makeshift camp. The tropical storm rages overhead, rain hammering the leaves and thunder shaking the ground. Inside your shelter, the air is cool and damp, a welcome respite from the relentless sun. You tend to your gear and gather strength, muscles relaxing as the storm’s fury passes. The jungle’s dangers remain, but for now, you are safe. This pause may prove vital, allowing you to face the challenges ahead with renewed vigor. The medallion still awaits, hidden in the collapsed cave, but patience may be your greatest ally.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*After the storm, proceed cautiously toward the collapsed cave*: (at_collapsed_cave: true)",
                "target": "node_5"
            },
            "option_1": {
                "text": "*Explore the jungle outskirts for signs of natives or safer routes*: (ally_present: true)",
                "target": "node_6"
            }
        }
    },
    "node_10": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- at_collapsed_cave: true  \n- medallion_found: true  \n- native_trust_earned: false  \n- at_village: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has carefully found the sacred medallion inside the collapsed cave without injury.\n\n**Narrative Description:**  \nYour fingers close around the cold, carved obsidian medallion, its surface etched with ancient symbols that seem to pulse faintly in the dim light. The air is thick with the scent of earth and forgotten history. You breathe a sigh of relief, knowing this sacred token is the key to earning the natives’ trust. The cave’s dangers have been navigated with care, and you emerge into the jungle’s embrace, medallion in hand. The path ahead leads to the native village, where acceptance awaits only if you present this sacred relic. The weight of your grandfather’s legacy feels lighter now, replaced by a growing sense of purpose and hope.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Travel directly to the native village to present the medallion*: (at_village: true)",
                "target": "node_15"
            },
            "option_1": {
                "text": "*Explore the jungle outskirts with the medallion to find allies*: (ally_present: true)",
                "target": "node_6"
            }
        }
    },
    "node_11": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- at_collapsed_cave: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: true  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer rushed through the cave, triggering traps and becoming wounded without finding the medallion.\n\n**Narrative Description:**  \nPain sears through your leg as a hidden trap snaps shut, its venomous barbs piercing your flesh. You stumble, breath ragged, the cave’s shadows closing in. The medallion remains elusive, and your haste has cost you dearly. Blood seeps through torn clothing, and dizziness threatens to overwhelm you. The jungle outside feels distant, and the path forward grows uncertain. Without the medallion, the natives will not trust you, and your injury slows every step. You must decide whether to press on despite your wounds or retreat to recover, knowing that time is against you.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Push forward to find the medallion despite your injury*: (medallion_found: true)",
                "target": "node_10"
            },
            "option_1": {
                "text": "*Retreat to the jungle edge to tend your wounds*: (wounded: false, at_jungle_edge: true)",
                "target": "node_9"
            },
            "option_2": {
                "text": "*Attempt to call for help, risking exposure to hostile natives*: (wounded: true, ally_present: false)",
                "target": "node_14 ❌"
            }
        }
    },
    "node_12": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- at_collapsed_cave: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- at_village: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: true  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer and native ally have entered the collapsed cave together but have not yet found the medallion.\n\n**Narrative Description:**  \nWith your native companion’s steady guidance, you navigate the treacherous cave. His keen eyes spot hidden traps and secret passages, allowing you to avoid danger. The air is thick with ancient dust and the weight of history. Together, you uncover a small alcove where the obsidian medallion rests on a stone pedestal, bathed in a faint, otherworldly glow. The moment feels sacred, a bridge between past and present. Your ally’s nod of approval strengthens your resolve. The medallion is yours, but the journey is far from over. Trust must now be earned, and the temple awaits beyond the jungle’s heart.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Take the medallion and head to the native village to earn trust*: (medallion_found: true, at_village: true, native_trust_earned: true)",
                "target": "node_13"
            },
            "option_1": {
                "text": "*Explore the jungle outskirts with your ally before visiting the village*: (ally_present: true)",
                "target": "node_7"
            }
        }
    },
    "node_13": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- medallion_found: true  \n- native_trust_earned: true  \n- at_village: true  \n- at_collapsed_cave: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: true  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has the medallion, is trusted by the natives, and is at the village with an ally.\n\n**Narrative Description:**  \nThe village welcomes you now, the sacred medallion a symbol of respect and connection. Natives greet you with nods and smiles, their suspicion replaced by cautious friendship. Your ally’s presence eases communication, and stories of the temple’s ancient puzzles and traps are shared around the firelight. The path to the temple lies beyond the jungle outskirts, guarded by ancestral mechanisms and natural dangers. You feel the weight of responsibility but also the thrill of nearing your goal. The medallion’s power and your newfound trust open doors previously closed. The final challenge awaits: the altar puzzle guarding the treasure vault.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Journey through the jungle outskirts toward the temple entrance*: (temple_accessible: true)",
                "target": "node_16"
            },
            "option_1": {
                "text": "*Spend time learning more from the natives about the altar puzzle*: (puzzle_solved: true)",
                "target": "node_17"
            },
            "option_2": {
                "text": "*Rest and prepare for the final leg of the journey*: (wounded: false)",
                "target": "node_18"
            }
        }
    },
    "node_14": {
        "description": "❌  \n**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- at_village: true  \n- medallion_found: false  \n- native_trust_earned: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: true  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer tried to negotiate trust without the medallion and was wounded or rejected.\n\n**Narrative Description:**  \nYour pleas fall on deaf ears. The natives, protective of their heritage, see your empty hands as a threat or insult. Tensions flare, and a skirmish breaks out. You are struck down, pain blossoming across your body as you fall to the ground. The village turns hostile, and escape becomes a desperate scramble through the jungle. Your mission ends here, thwarted by impatience and lack of respect. The island’s secrets remain hidden, and the treasure forever out of reach.\n\n**Ending:**  \nYou have failed to earn the natives’ trust without the medallion and were gravely wounded. Your quest ends in defeat.  \n\n---",
        "options": {}
    },
    "node_15": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: true  \n- at_village: true  \n- medallion_found: true  \n- native_trust_earned: false  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has the medallion and arrives at the village but has not yet earned trust.\n\n**Narrative Description:**  \nYou present the sacred medallion to the village elders, their eyes widening in recognition. The air shifts as murmurs ripple through the crowd. Slowly, the elders nod, signaling acceptance. Trust is earned, but it is fragile and must be nurtured. The path to the temple now lies open, but dangers remain. The jungle outskirts are riddled with traps and puzzles that guard the treasure vault. Your journey is far from over, but hope burns brighter than ever. The medallion’s power and the natives’ trust are your keys to success.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Proceed through the jungle outskirts toward the temple entrance*: (temple_accessible: true, native_trust_earned: true)",
                "target": "node_16"
            },
            "option_1": {
                "text": "*Seek advice from the elders about the altar puzzle*: (puzzle_solved: true)",
                "target": "node_17"
            }
        }
    },
    "node_16": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: false  \n- at_village: false  \n- medallion_found: true  \n- native_trust_earned: true  \n- temple_accessible: true  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has earned native trust and reached the temple entrance.\n\n**Narrative Description:**  \nThe jungle outskirts give way to ancient stone steps, worn by centuries of rain and time. The temple looms ahead, its towering facade carved with intricate glyphs and symbols. The air is heavy with anticipation and the scent of moss and incense. You know the treasure lies beyond the altar, but the puzzle guarding it is complex and unforgiving. The medallion pulses faintly against your chest, a reminder of the journey and the trust earned. Every step forward is a test of wit and courage. The final challenge awaits.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Attempt to solve the altar puzzle using the medallion’s clues*: (puzzle_solved: true)",
                "target": "node_19"
            },
            "option_1": {
                "text": "*Search the temple grounds for additional hints or traps*: (wounded: false)",
                "target": "node_18"
            }
        }
    },
    "node_17": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: false  \n- at_village: true  \n- medallion_found: true  \n- native_trust_earned: true  \n- temple_accessible: false  \n- puzzle_solved: true  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: true  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has learned the altar puzzle from the natives and solved it before reaching the temple.\n\n**Narrative Description:**  \nGuided by your native ally, you study the ancient glyphs and mechanisms of the altar. The medallion’s symbols align with the puzzle’s components, revealing a sequence of movements and incantations. Hours pass as you decipher the code, your mind racing with excitement and caution. The puzzle’s complexity is daunting, but your perseverance pays off. The altar clicks and shifts, revealing a hidden passage. The temple’s treasure vault lies open, but the journey here has been long and fraught with peril. Victory feels within reach.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Enter the treasure vault to claim the treasure*: (treasure_claimed: true)",
                "target": "node_20 ✅"
            },
            "option_1": {
                "text": "*Double-check the puzzle’s solution for traps or false triggers*: (wounded: false)",
                "target": "node_18"
            }
        }
    },
    "node_18": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: false  \n- at_village: true  \n- medallion_found: true  \n- native_trust_earned: true  \n- temple_accessible: false  \n- puzzle_solved: false  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: true  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer rests or searches for clues before solving the puzzle or entering the temple.\n\n**Narrative Description:**  \nYou take a moment to rest and gather your thoughts, the jungle’s sounds a soothing backdrop. Your native ally shares stories of the temple’s history and warns of hidden dangers. Together, you scour the temple grounds, uncovering faint markings and subtle traps. The puzzle’s complexity becomes clearer, and you prepare to face it with renewed confidence. The treasure is close, but haste could be fatal. Patience and caution are your allies now.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Attempt to solve the altar puzzle*: (puzzle_solved: true)",
                "target": "node_19"
            },
            "option_1": {
                "text": "*Explore further for additional clues or safety*: (wounded: false)",
                "target": "node_7"
            }
        }
    },
    "node_19": {
        "description": "**Current State:**  \n- at_shore: false  \n- at_jungle_edge: false  \n- at_village: false  \n- medallion_found: true  \n- native_trust_earned: true  \n- temple_accessible: true  \n- puzzle_solved: true  \n- treasure_claimed: false  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has reached the temple, solved the altar puzzle, and is ready to claim the treasure.\n\n**Narrative Description:**  \nThe altar’s final mechanism clicks into place, and a hidden door grinds open, revealing a chamber bathed in golden light. The treasure vault lies before you, filled with ancient artifacts, gold coins, and priceless relics. The air is thick with the scent of history and triumph. Your journey, marked by peril and perseverance, culminates here. The medallion’s glow fades, its purpose fulfilled. You step forward, heart pounding, to claim the treasure that has eluded so many. The island’s secrets are yours at last.\n\n**Choices:**",
        "options": {
            "option_0": {
                "text": "*Take the treasure and prepare to leave the island*: (treasure_claimed: true)",
                "target": "node_20 ✅"
            },
            "option_1": {
                "text": "*Inspect the treasure for traps before taking it*: (wounded: false)",
                "target": "node_18"
            }
        }
    },
    "node_20": {
        "description": "✅  \n**Current State:**  \n- at_shore: false  \n- at_jungle_edge: false  \n- at_village: false  \n- medallion_found: true  \n- native_trust_earned: true  \n- temple_accessible: true  \n- puzzle_solved: true  \n- treasure_claimed: true  \n- wounded: false  \n- ally_present: false  \n- lost_in_jungle: false  \n\n**Prerequisites:**  \nThe adventurer has claimed the treasure after solving the puzzle and earning native trust.\n\n**Narrative Description:**  \nWith the treasure secured, you feel a profound sense of accomplishment. The island’s mysteries have been unraveled through courage, wisdom, and respect. The medallion’s journey from the collapsed cave to the temple altar symbolizes the bond forged between you and the island’s guardians. As you prepare to leave, the jungle seems less foreboding, almost grateful. Your grandfather’s legacy lives on, and the treasure’s secrets are now yours to share with the world. The adventure ends not just with gold, but with stories of trust, perseverance, and discovery.\n\n**Ending:**  \nYou have successfully completed the quest, overcoming all obstacles and claiming the treasure. Congratulations! ✅  \n\n---\n\n❌ Failure endings summary:  \n- Section 14: Failure due to lack of medallion and hostile natives.  \n- Section 11 (implicit risk): Wounded and vulnerable, risking failure if poor choices follow.  \n- Additional failure possible if ignoring key steps or rushing traps (implied in narrative).",
        "options": {}
    }
}